pycom/pycom-micropython-sigfox/esp32/lte/lteppp.c
        // if we are coming from a power on reset, disable the LTE radio
        if (mpsleep_get_reset_cause() < MPSLEEP_WDT_RESET) {
            lteppp_send_at_cmd("AT+CFUN?", LTE_RX_TIMEOUT_MAX_MS);
            if (!sim_present) {
                lteppp_send_at_cmd("AT+CFUN=0", LTE_RX_TIMEOUT_MAX_MS);
            }
        }

        // enable airplane low power mode
        lteppp_send_at_cmd("AT!=\"setlpm airplane=1 enable=1\"", LTE_RX_TIMEOUT_MAX_MS);
        // enable Break Signal for URC on UART0
        lteppp_send_at_cmd("AT+SQNIBRCFG?", LTE_RX_TIMEOUT_MAX_MS);
        if(!strstr(lteppp_trx_buffer, "+SQNIBRCFG: 1,100"))
        {
            lteppp_send_at_cmd("AT+SQNIBRCFG=1,100", LTE_RX_TIMEOUT_MAX_MS);
        }
        xSemaphoreTake(xLTESem, portMAX_DELAY);
        lteppp_modem_conn_state = E_LTE_MODEM_CONNECTED;
        xSemaphoreGive(xLTESem);
        xSemaphoreGive(xLTE_modem_Conn_Sem);
        lte_state_t state;
        for (;;) {
            vTaskDelay(LTE_TASK_PERIOD_MS);
            xSemaphoreTake(xLTESem, portMAX_DELAY);
            if(E_LTE_MODEM_DISCONNECTED == lteppp_modem_conn_state)
            {
                xSemaphoreGive(xLTESem);
                // restart the task
                goto modem_init;
            }
            xSemaphoreGive(xLTESem);
            state = lteppp_get_state();
            if (xQueueReceive(xCmdQueue, lteppp_trx_buffer, 0)) {
                bool expect_continuation = lte_task_cmd->expect_continuation;
                lteppp_send_at_cmd_exp(lte_task_cmd->data, lte_task_cmd->timeout, NULL, &(lte_task_rsp->data_remaining), lte_task_cmd->dataLen, lte_task_cmd->expect_continuation);
                if(!expect_continuation)
                    xQueueSend(xRxQueue, (void *)lte_task_rsp, (TickType_t)portMAX_DELAY);
            }
            else if(state == E_LTE_PPP && lte_uart_break_evt)
            {
                lteppp_send_at_cmd("+++", LTE_PPP_BACK_OFF_TIME_MS);
                lteppp_suspend();
            }
            else
            {
                if (state == E_LTE_PPP) {
                    uint32_t rx_len;
                    // check for IP connection
                    if(lteppp_ipv4() > 0)
                    {
                        ltepp_ppp_conn_up = true;
                    }
                    else
                    {
                        if(ltepp_ppp_conn_up == true)
                        {
                            ltepp_ppp_conn_up = false;
                            lteppp_set_state(E_LTE_ATTACHED);
                        }
                    }
                    // wait for characters received
                    uart_get_buffered_data_len(LTE_UART_ID, &rx_len);
                    if (rx_len > 0) {
                        // try to read up to the size of the buffer
                        rx_len = uart_read_bytes(LTE_UART_ID, (uint8_t *)lteppp_trx_buffer, LTE_UART_BUFFER_SIZE,
                                                 LTE_TRX_WAIT_MS(LTE_UART_BUFFER_SIZE) / portTICK_RATE_MS);
                        if (rx_len > 0) {
                            pppos_input_tcpip(lteppp_pcb, (uint8_t *)lteppp_trx_buffer, rx_len);
                        }
                    }
                }
                else
                {
                    ltepp_ppp_conn_up = false;
                }
            }
        }
    }
    goto modem_init;
}

static void TASK_UART_EVT (void *pvParameters)
{
    uart_event_t event;
    uint8_t buff[50] = {0};
    for(;;) {
        //Waiting for UART event.
        if(xQueueReceive(uart0_queue, (void * )&event, (portTickType)portMAX_DELAY)) {

            switch(event.type)
            {
                case UART_DATA:
                    if (lte_uart_break_evt) {

                        uint32_t rx_len = uart_read_bytes(LTE_UART_ID, buff, LTE_UART_BUFFER_SIZE,
                                                                         LTE_TRX_WAIT_MS(LTE_UART_BUFFER_SIZE) / portTICK_RATE_MS);

                        if ((rx_len) && (strstr((const char *)buff, "OK") != NULL))
                        {
                            if(strstr((const char *)buff, "+CEREG: 4") != NULL)
                            {
                                modlte_urc_events(LTE_EVENT_COVERAGE_LOST);
                            }

                            lte_uart_break_evt = false;
                        }
                    }
                    break;
                case UART_BREAK:
                    if (E_LTE_PPP == lteppp_get_state()) {
                        lte_uart_break_evt = true;
                    }
                    break;
                default:
                    break;
            }
        }
    }
    vTaskDelete(NULL);
}


static bool lteppp_send_at_cmd_exp (const char *cmd, uint32_t timeout, const char *expected_rsp, void* data_rem, size_t len, bool expect_continuation) {

    if(strstr(cmd, "Pycom_Dummy") != NULL)
    {
#ifdef LTE_DEBUG_BUFF
        if (lteppp_log.ptr < (LTE_LOG_BUFF_SIZE - strlen("[CMD]: Dummy") + 1))
        {
            memcpy(&(lteppp_log.log[lteppp_log.ptr]), "[CMD]: Dummy", strlen("[CMD]: Dummy"));
            lteppp_log.ptr += strlen("[CMD]: Dummy");
            lteppp_log.log[lteppp_log.ptr] = '\n';
            lteppp_log.ptr++;
        }
        else
        {
            lteppp_log.ptr = 0;
            lteppp_log.truncated = true;
        }
#endif
        return lteppp_wait_at_rsp(expected_rsp, timeout, false, data_rem);
    }
    else
    {
        size_t cmd_len = len;
        // char tmp_buf[128];
#ifdef LTE_DEBUG_BUFF
        if (lteppp_log.ptr < (LTE_LOG_BUFF_SIZE - strlen("[CMD]:") - cmd_len + 1))
        {
            memcpy(&(lteppp_log.log[lteppp_log.ptr]), "[CMD]:", strlen("[CMD]:"));
            lteppp_log.ptr += strlen("[CMD]:");
            memcpy(&(lteppp_log.log[lteppp_log.ptr]), cmd, cmd_len);
            lteppp_log.ptr += cmd_len;
            lteppp_log.log[lteppp_log.ptr] = '\n';
            lteppp_log.ptr++;
        }
        else
        {
            lteppp_log.ptr = 0;
            lteppp_log.truncated = true;
        }
#endif
        // flush the rx buffer first
        if(!expect_continuation || (len >= 2 && cmd[0] == 'A' && cmd[1] == 'T')) // starts with AT
        {
            uart_flush(LTE_UART_ID);
        }
        // uart_read_bytes(LTE_UART_ID, (uint8_t *)tmp_buf, sizeof(tmp_buf), 5 / portTICK_RATE_MS);
        // then send the command
        uart_write_bytes(LTE_UART_ID, cmd, cmd_len);

