pycom/pycom-micropython-sigfox/esp32/lte/lteppp.c
        if(expect_continuation)
        {
            return true;
        }
        else {
            if (strcmp(cmd, "+++"))
            {
                uart_write_bytes(LTE_UART_ID, "\r", 1);
            }

            uart_wait_tx_done(LTE_UART_ID, LTE_TRX_WAIT_MS(cmd_len) / portTICK_RATE_MS);
            vTaskDelay(2 / portTICK_RATE_MS);

            return lteppp_wait_at_rsp(expected_rsp, timeout, false, data_rem);
        }
    }
}

static bool lteppp_send_at_cmd(const char *cmd, uint32_t timeout) {
    return lteppp_send_at_cmd_exp (cmd, timeout, LTE_OK_RSP, NULL, strlen(cmd), false);
}

static bool lteppp_check_sim_present(void) {
    lteppp_send_at_cmd("AT+CPIN?", LTE_RX_TIMEOUT_MAX_MS);
    if (strstr(lteppp_trx_buffer, "ERROR")) {
        return false;
    } else {
        return true;
    }
}

// PPP output callback
static uint32_t lteppp_output_callback(ppp_pcb *pcb, u8_t *data, u32_t len, void *ctx) {
    LWIP_UNUSED_ARG(ctx);
    uint32_t tx_bytes;
    static uint32_t top =0;
    if (lteppp_connstatus == LTE_PPP_IDLE || lteppp_connstatus == LTE_PPP_RESUMED) {
        if(top > 0 && lteppp_connstatus == LTE_PPP_RESUMED)
        {
            uart_write_bytes(LTE_UART_ID, (const char*)lteppp_queue_buffer, top+1);
            uart_wait_tx_done(LTE_UART_ID, LTE_TRX_WAIT_MS(top+1) / portTICK_RATE_MS);
        }
        top = 0;
        tx_bytes = uart_write_bytes(LTE_UART_ID, (const char*)data, len);
        uart_wait_tx_done(LTE_UART_ID, LTE_TRX_WAIT_MS(len) / portTICK_RATE_MS);
    }
    else
    {
        uint32_t temp = top + len;
        if(temp > LTE_UART_BUFFER_SIZE)
        {
            return 0;
        }
        else
        {
            memcpy(&(lteppp_queue_buffer[top]), (const char*)data, len);
            top += len;
            return len;
        }
    }
    return tx_bytes;
}

// PPP status callback
static void lteppp_status_cb (ppp_pcb *pcb, int err_code, void *ctx) {
    struct netif *pppif = ppp_netif(pcb);
    LWIP_UNUSED_ARG(ctx);

    switch (err_code) {
    case PPPERR_NONE:
//        printf("status_cb: Connected\n");
        #if PPP_IPV4_SUPPORT
        lte_gw = pppif->gw.u_addr.ip4.addr;
        lte_netmask = pppif->netmask.u_addr.ip4.addr;
        lte_ipv4addr = pppif->ip_addr.u_addr.ip4.addr;
        if(lte_ipv4addr > 0)
        {
            ltepp_dns_info[0] = *(dns_getserver(0));
            ltepp_dns_info[1] = *(dns_getserver(1));
        }
//        printf("ipaddr    = %s\n", ipaddr_ntoa(&pppif->ip_addr));
//        printf("gateway   = %s\n", ipaddr_ntoa(&pppif->gw));
//        printf("netmask   = %s\n", ipaddr_ntoa(&pppif->netmask));
        #endif
        #if PPP_IPV6_SUPPORT
        memcpy(lte_ipv6addr.addr, netif_ip6_addr(pppif, 0), sizeof(lte_ipv4addr));
//        printf("ip6addr   = %s\n", ip6addr_ntoa(netif_ip6_addr(pppif, 0)));
        #endif
        break;
    case PPPERR_PARAM:
//        printf("status_cb: Invalid parameter\n");
        break;
    case PPPERR_OPEN:
//        printf("status_cb: Unable to open PPP session\n");
        break;
    case PPPERR_DEVICE:
//        printf("status_cb: Invalid I/O device for PPP\n");
        break;
    case PPPERR_ALLOC:
//        printf("status_cb: Unable to allocate resources\n");
        break;
    case PPPERR_USER:
//        printf("status_cb: User interrupt (disconnected)\n");
        lte_ipv4addr = 0;
        memset(lte_ipv6addr.addr, 0, sizeof(lte_ipv6addr.addr));
        break;
    case PPPERR_CONNECT:
//        printf("status_cb: Connection lost\n");
        lte_ipv4addr = 0;
        memset(lte_ipv6addr.addr, 0, sizeof(lte_ipv6addr.addr));
        break;
    case PPPERR_AUTHFAIL:
//        printf("status_cb: Failed authentication challenge\n");
        break;
    case PPPERR_PROTOCOL:
//        printf("status_cb: Failed to meet protocol\n");
        break;
    case PPPERR_PEERDEAD:
//        printf("status_cb: Connection timeout\n");
        break;
    case PPPERR_IDLETIMEOUT:
//        printf("status_cb: Idle Timeout\n");
        break;
    case PPPERR_CONNECTTIME:
//        printf("status_cb: Max connect time reached\n");
        break;
    case PPPERR_LOOPBACK:
//        printf("status_cb: Loopback detected\n");
        break;
    default:
//        printf("status_cb: Unknown error code %d\n", err_code);
        lte_ipv4addr = 0;
        memset(lte_ipv6addr.addr, 0, sizeof(lte_ipv6addr.addr));
        break;
    }
}
